---
kind: type
id: T:Autodesk.Revit.DB.Macros.MacroManager
source: html/49eb4b8a-ae13-95e7-fef4-11347bbb67d3.htm
---
# Autodesk.Revit.DB.Macros.MacroManager

Manager object for the Macro modules of the application.

## Syntax (C#)
```csharp
public class MacroManager : IEnumerable<MacroModule>,
	IDisposable
```